use housedata2;

insert into member
values('ssafy', 'ssafy', '0000', '경기 성남시 분당구 삼평동 681', '010-0000-0000', 'admin'),
('seojeong', 'seojeong', '0000', '경기 시흥시 신천동 734-6', '010-0000-0000', 'user'),
('alex', 'alex', '0000', '경기 시흥시 배곧동 204','010-0000-0000', 'user'),
('ali', 'ali', '0000', '경북 구미시 옥계동 794-1','010-0000-0000','user'),
('andy', 'andy', '0000', '부산 기장군 용수리 1387', '010-0000-0000','user'),
('billy', 'billy', '0000', '서울 강남구 역삼동 798', '010-0000-0000','user'),
('caley', 'caley', '0000', '서울 강남구 역삼동 797-27', '010-0000-0000','user'),
('eden', 'eden', '0000', '서울 강남구 역삼동 785-10', '010-0000-0000','user'),
('elin', 'elin', '0000', '서울 강남구 역삼동 785-2', '010-0000-0000','user'),
('fanny', 'fanny', '0000', '서울 광진구 화양동 4-20', '010-0000-0000','user'),
('gili', 'gili', '0000', '서울 광진구 화양동 42-3', '010-0000-0000','user'),
('hedy', 'hedy', '0000', '서울 마포구 합정동 413-15', '010-0000-0000', 'user'),
('hope', 'hope', '0000', '서울 마포구 합정동 363-29 ', '010-0000-0000', 'user'),
('hue', 'hue', '0000', '서울 마포구 상수동 310-23', '010-0000-0000', 'user'),
('lris', 'lris', '0000', '서울 마포구 상수동 93-6','010-0000-0000', 'user'),
('isabel', 'isabel', '0000', '서울 마포구 창전동 6-104','010-0000-0000','user'),
('ivy', 'ivy', '0000', '대구 북구 금호동 199', '010-0000-0000','user'),
('jack', 'jack', '0000', '인천 강화군 양도면 능내리 894', '010-0000-0000','user'),
('jacob', 'jacob', '0000', '인천 강화군 양도면 조산리 754', '010-0000-0000','user'),
('jamie', 'jamie', '0000', '인천 남동구 논현동 673-1', '010-0000-0000','user');

-- '1111010100'은 서울특별시 종로구 청운동
-- '1111011500'은 서울특별시 종로구 사직동
insert into interest (user_id, dongCode)
values ('ssafy', '1111010100'),
('ssafy', '1111011500');
